examples/OpenFOAM/pipe_with_recirc/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            noSlip;
    }
    
    inlet
    {
        type            codedFixedValue;
        value           uniform (0.1 0 0);
        
        name parabolicVelocity;
        code
        #{
              const vectorField& Cf=patch().Cf();
              vectorField& field = *this;
              
              const scalar a = 4;
              const scalar b = 0.5;
              
              forAll(Cf, faceI)
              {
                  const scalar y = Cf[faceI][1];   
                  field[faceI] = vector(a*y*(b-y),0,0);
                  
              }
        #};
    }

    outlet
    {
        type            zeroGradient;
    }

    top_and_bottom
    {
        type            empty;
    }
}

// ************************************************************************* //
